package seeders

import (
	D "docker/database"
	M "docker/models"
	"math/rand"
)

func LawCommentsSeeder() {
	users := []M.User{}
	laws := []M.Law{}
	D.DB().Select("id").Find(&users)
	D.DB().Select("id").Find(&laws)
	comments := []string{
		"از این سامانه راضیم",
		"قانون های جدید باید در راستای پیشرفت کشور باشن",
		"به نظر شما اگر به ملی گرایان احترام بیشتری بگذاریم، پیشرفت نخواهیم کرد؟",
		"به نظرم این مصوبه مشکلات زیادی دارد",
		"این قانون در راستای منافع قدرتمندان است",
		"مرسی برای تصویب این قانون عالی",
		"ممنون از تمامی اطلاعات مفیدی که در وبسایت شما درباره قوانین و مقررات کشور ارائه می‌شود.",
		"آیا می‌توانم بیشتر در مورد رویه تحصیل حقوق در ایران بدانم؟",
		"اینجا یک منبع بسیار عالی برای پیدا کردن خلاصه قوانین است.",
		"دردسرهای زیادی در مورد تفسیر قوانین در استان خود داشته‌ام. آیا میتوانید راهنمایی‌ای برای من داشته باشید؟",
		"بهترین و مفیدترین وب سایتی که تا به حال به دست داشته‌ام. آیا می‌توانید موارد بیشتری درباره قانون از این طریق ارائه دهید؟",
		"من تازه به خانه جدیدم نقل مکان کرده‌ایم - آیا می‌توانید من را به منابعی برای درک بهتر وضعیت المنازل در شهرم ارجاع دهید؟",
		"اینجا وب سایتی کاربردی برای درک بهتر قوانین است.",
		"در سترداد همیشه با مشکل جدی قانونی مواجه هستیم. این سایت به یک منبع زیبا در برابر آن تبدیل شده است.",
		"همیشه با خواندن دستور العمل های شما و تفسیرات قوانین راه حلی برای مسائل حقوقی خود پیدا کرده‌ام.",
		"بسیار جالب و پویا. مطالب بسیار جذاب و جذاب هستند و به عنوان یک دانشجو ارزش عالی دارند.",
	}
	// ! create 20 random comments and assign them to random users
	for i := 0; i < 20; i++ {
		// commentRandomNumber := rand.Intn(11) + 10 // generates a random integer between 10 and 20 (inclusive)
		commentRandomNumber := rand.Intn(len(comments))
		userRandomNumber := rand.Intn(len(users))
		lawRandomNumber := rand.Intn(len(laws))
		D.DB().Create(&M.Comment{
			Body:   comments[commentRandomNumber],
			UserID: users[userRandomNumber].ID,
			LawID:  laws[lawRandomNumber].ID,
		})
	}
}
